rr_results/fio_rrt16_16g_iod16.log
seq-read-loop: (g=0): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=16
fio-3.28
Starting 1 process

seq-read-loop: (groupid=0, jobs=1): err= 0: pid=97585: Mon Jun  1 14:27:10 2026
  read: IOPS=18.8k, BW=2355MiB/s (2469MB/s)(414GiB/180002msec)
    slat (nsec): min=1845, max=718888, avg=3645.55, stdev=1217.84
    clat (usec): min=61, max=3220, avg=845.29, stdev=479.33
     lat (usec): min=122, max=3224, avg=848.98, stdev=479.37
    clat percentiles (usec):
     |  1.00th=[  379],  5.00th=[  586], 10.00th=[  594], 20.00th=[  594],
     | 30.00th=[  594], 40.00th=[  594], 50.00th=[  594], 60.00th=[  594],
     | 70.00th=[  594], 80.00th=[ 1549], 90.00th=[ 1598], 95.00th=[ 1647],
     | 99.00th=[ 2671], 99.50th=[ 2802], 99.90th=[ 2933], 99.95th=[ 2933],
     | 99.99th=[ 2966]
   bw (  MiB/s): min= 1236, max= 3353, per=100.00%, avg=2356.44, stdev=692.90, samples=720
   iops        : min=13200, max=25470, avg=18851.25, stdev=3295.34, samples=360
  lat (usec)   : 100=0.01%, 250=0.18%, 500=1.41%, 750=73.80%, 1000=0.26%
  lat (msec)   : 2=22.57%, 4=1.78%
  cpu          : usr=1.35%, sys=7.79%, ctx=1756651, majf=0, minf=522
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3391280,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=2355MiB/s (2469MB/s), 2355MiB/s-2355MiB/s (2469MB/s-2469MB/s), io=414GiB (445GB), run=180002-180002msec

Disk stats (read/write):
  nvme1n1: ios=1778921/0, merge=1610973/0, ticks=1496022/0, in_queue=1496022, util=100.00%