rr_results/fio_rrt256_16g_250ms.log
seq-read-loop: (g=0): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process

seq-read-loop: (groupid=0, jobs=1): err= 0: pid=72948: Mon Jun  1 13:56:47 2026
  read: IOPS=7589, BW=949MiB/s (995MB/s)(167GiB/180001msec)
    clat (usec): min=121, max=2130, avg=131.53, stdev=36.34
     lat (usec): min=121, max=2130, avg=131.56, stdev=36.34
    clat percentiles (usec):
     |  1.00th=[  122],  5.00th=[  123], 10.00th=[  123], 20.00th=[  123],
     | 30.00th=[  126], 40.00th=[  127], 50.00th=[  135], 60.00th=[  135],
     | 70.00th=[  135], 80.00th=[  137], 90.00th=[  139], 95.00th=[  141],
     | 99.00th=[  143], 99.50th=[  143], 99.90th=[  239], 99.95th=[ 1303],
     | 99.99th=[ 1369]
   bw (  KiB/s): min=618923, max=991744, per=100.00%, avg=972085.51, stdev=50491.88, samples=719
   iops        : min= 4841, max= 7742, avg=7594.17, stdev=367.74, samples=359
  lat (usec)   : 250=99.90%, 500=0.01%
  lat (msec)   : 2=0.10%, 4=0.01%
  cpu          : usr=0.27%, sys=2.79%, ctx=1366483, majf=0, minf=45
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1366202,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=949MiB/s (995MB/s), 949MiB/s-949MiB/s (995MB/s-995MB/s), io=167GiB (179GB), run=180001-180001msec

Disk stats (read/write):
  nvme1n1: ios=1365375/0, merge=0/0, ticks=174265/0, in_queue=174265, util=96.98%