rr_results/fio_rrt64_16g.log
seq-read-loop: (g=0): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process

seq-read-loop: (groupid=0, jobs=1): err= 0: pid=10579: Mon Jun  1 00:47:21 2026
  read: IOPS=7440, BW=930MiB/s (975MB/s)(163GiB/180001msec)
    clat (usec): min=121, max=2149, avg=134.22, stdev=70.82
     lat (usec): min=121, max=2149, avg=134.24, stdev=70.82
    clat percentiles (usec):
     |  1.00th=[  123],  5.00th=[  123], 10.00th=[  123], 20.00th=[  123],
     | 30.00th=[  123], 40.00th=[  127], 50.00th=[  135], 60.00th=[  135],
     | 70.00th=[  135], 80.00th=[  135], 90.00th=[  139], 95.00th=[  139],
     | 99.00th=[  143], 99.50th=[  143], 99.90th=[ 1319], 99.95th=[ 1352],
     | 99.99th=[ 1369]
   bw (  KiB/s): min=669725, max=990814, per=100.00%, avg=952523.73, stdev=76799.44, samples=179
   iops        : min= 4846, max= 7746, avg=7442.27, stdev=696.58, samples=359
  lat (usec)   : 250=99.61%, 500=0.01%, 1000=0.01%
  lat (msec)   : 2=0.39%, 4=0.01%
  cpu          : usr=0.22%, sys=2.48%, ctx=1340331, majf=0, minf=44
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1339343,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=930MiB/s (975MB/s), 930MiB/s-930MiB/s (975MB/s-975MB/s), io=163GiB (176GB), run=180001-180001msec

Disk stats (read/write):
  nvme1n1: ios=1338518/0, merge=0/0, ticks=175006/0, in_queue=175006, util=97.32%